import axios from 'axios';
import type { Response } from './transformResponse';
import { transformResponse } from './transformResponse';

export interface GetRecommendListPayload {
  type: '觀光景點' | '美食' | '廁所' | '公園';
}

interface Item {
  名稱: string;
  地址: string;
  備註: string;
  src: string;
}

/**
 * 取得建議列表
 */
export async function getRecommendList(payload: GetRecommendListPayload): Promise<Response<Item[]>> {
  const { type } = payload;
  try {
    // const response = await axios.get('/getRecommendList', {
    //   params: {
    //     type,
    //   }
    // });

    const response: Item[] = await new Promise((resolve, reject) => {
      setTimeout(() => {
        resolve(mockData[type] ?? []);
      }, 50);
    })

    return transformResponse({
      code: '0001',
      msg: 'success',
      data: response
    });
  } catch (error) {
    console.error('Error fetching fuzzy search list:', error);
    throw new Error('Failed to fetch fuzzy search list');
  }
}

const mockData = {
  '觀光景點': [
    {
      "名稱": "新竹州廳—新竹市政府",
      "AreaCode": "10018020",
      "地址": "新竹市中正路120號",
      "備註": "新竹州廳建於1925年，建築形式為和洋混合風格，是當時常用建築風格。正門玄關採用雙柱式門廊搭配兩側小塔樓，頗有氣勢。大廳內的洋式拱廊與羅馬柱十分氣派，翼樓突出的量體增加了穩重感，整體形式視野開闊，氣勢磅礡。",
      "src": "https://www.taiwan.net.tw/pic.ashx?qp=1/big_scenic_spots/pic_10869_1.jpg&sizetype=3"
    },
    {
      "名稱": "都城隍廟",
      "AreaCode": "10018020",
      "地址": "新竹市中山路75號",
      "備註": "為三級古蹟，與竹蓮寺、外天后宮並稱為新竹三大廟宇，建築規模宏大，本體採三殿式，龍柱、石獅大門上方八卦藻井都是一代名匠所造，大殿上懸掛的「金門保障」匾額，為清光緒帝所賜，是全台位階最高的城隍爺。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=26&module=travel&detailNo=1188764551353470976&serno=89b26b65-4418-45c0-aefe-db5f6f7d84bb&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "新竹驛—新竹火車站",
      "AreaCode": "10018010",
      "地址": "新竹市中華路二段445號",
      "備註": "新竹百年老車站建於1913年，由留學德國的日本人松ケ崎萬長設計，是一座混合式的西洋建築，新竹驛呈現德國近代建築風采，主要採德式歌德建築元素，但也具有部分巴洛克建築風格，迥異於同時期其他官廳建築，是鐵道建築中的經典。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=26&module=travel&detailNo=1188761130911141888&serno=fa91be25-8a2a-402b-b749-4d7be3d70b58&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "香山火車站",
      "AreaCode": "10018030",
      "地址": "新竹市中華路5段349巷2弄7號",
      "備註": "香山驛建於1928年，是西部鐵道幹線碩果僅存的木造火車站之一，以阿里山運來的檜木，建造純日式風格建築，至今依然保存完好。雖然候車空間狹小，但與當地人生活息息相關，成為香山人記憶中不可或缺的建築。",
      "src": "https://i0.wp.com/journey.tw/wp-content/uploads/20200319223346_43.jpg?resize=1100%2C734&quality=99&ssl=1"
    },
    {
      "名稱": "十八尖山",
      "AreaCode": "10018010",
      "地址": "新竹市寶山路與博愛路",
      "備註": "小巧的十八尖山為小百岳之一，是昭和2年開闢，十八尖山路線圖呈新月形，漫山蜿蜒約7、8公里，環繞了新竹市東南郊。十八尖山是確實有十八個淺淺的尖山頭，沿途遍山茂林與花卉，夾道飄香，是市民運動休閒的路線。十八尖山有多座涼亭，幸福亭是一座造型典雅的六角亭，介壽亭則位在最高點，山林內有33尊石觀音雕像（現存24座），是台灣修建最早的森林公園。每逢花季盛開，如茶花、杜鵑花、杏花與桃花、桂花等，景致迷人。",
      "src": "https://www.taiwan.net.tw/att/1/big_scenic_spots/pic_10867_2.jpg"
    },
    {
      "名稱": "高峰植物園",
      "AreaCode": "10018010",
      "地址": "新竹市東區寶山路仙宮里9鄰",
      "備註": "高峰植物園設於1932年日治時代，原名「新竹州立赤土崎林業試驗場」，佔地二、三十公頃，培育多種本土植物及外來樹種，計有342種植物，目前並已發現40種鳥類及20種蟲類，四季還有候鳥行經或留鳥棲息，擁有豐美生態體系。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=28&module=travel&detailNo=1174275790947225600&serno=62c4652e-5d2a-4834-a334-44498c7bbfba&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "青青草原",
      "AreaCode": "10018030",
      "地址": "新竹市元培街往香山中學方向(沿路有標示)",
      "備註": "青青草原位於香山丘陵內，保有牧草區與林像，是新竹市難得的自然山林。這一片一望無際翠綠的大草原有油桐植栽，黑板樹植栽、休憩涼亭，是踏青及放風箏的好所在。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=25&module=travel&detailNo=1188773362873143296&serno=88525867-c07c-4e24-80dd-0f47b013f62d&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "青青草原溜滑梯",
      "AreaCode": "10018030",
      "地址": "新竹市草原路青青草原入口處",
      "備註": "青青草原草原路入口區配合山丘地形，打造戶外兒童遊樂場設置探索區與賞鳥教育區，設置有四座大型磨石子彩色溜滑梯，溜滑梯最長滑道總長約54公尺，為北台灣最長磨石子溜滑梯。探索區除溜滑梯外並有兒童爬網，賞鳥樹屋，兒童傳聲筒等遊樂設施，小朋友奔跑在木平台階梯，由戶外溜滑梯高處滑下可觀賞五色鳥，紅嘴黑鵯，喜鵲等，為最大也最有趣的自然生態兒童遊樂場，可為大朋友及小朋友帶來高探索性的豐富遊樂體驗。",
      "src": "https://buklentw.com/wp-content/uploads/2023/07/IMG_3078.jpg"
    },
    {
      "名稱": "青草湖",
      "AreaCode": "10018010",
      "地址": "新竹市明湖路775巷",
      "備註": "青草湖曾為重要水庫，新竹市政府於民國96年以杭州西湖為藍圖，徹底改造青草湖，形成小西湖的景致。環湖步道串聯了周邊風景，靈隱寺、鳳凰橋、映月橋、于飛島等景點，很適合慢步或單車環湖。新竹市政府近年著手推動青草湖環境改善，積極進行清淤工作，並針對景觀平台、木棧道、照明設施規劃整建，更推出新型水域遊憩，106年9月青草湖水域遊憩中心開始營運，帶入運動、休閒元素，結合青草湖環境優勢，舉辦各項水上活動，營造城市運動風氣。",
      "src": "https://www.taiwan.net.tw/att/1/big_scenic_spots/pic_C100_410_3.jpg"
    },
    {
      "名稱": "十七公里海岸線",
      "AreaCode": "10018020",
      "地址": "東西向快速道路西端終點附近，頭前溪橋出海口",
      "備註": "新竹沿海蔚藍海岸線十七公里處，上千公頃的潮間帶，是北台灣最大的海濱溼地，孕育了大量的蝦蟹螺貝類，漁產豐富的新竹漁港，除了嘗海鮮、放風箏、欣賞港口各式漁船美景之外，也能騎鐵馬欣賞沿途怡人的風光。而紅樹林公園、金城湖賞鳥區、賞鳥棧道，則富含各種生態風貌，客雅溪口潮間帶留鳥與候鳥時時流連，騎著自行車在海邊逐風而行，或是晨起賞鳥暮映落日，是假日舒適的好去處。香山濕地自然生態區、美山蔚藍海岸區、海山漁港等地，遍地的招潮蟹與和尚蟹，是極富樂趣與教育意義的親子戲水弄潮天堂。",
      "src": "https://pic.pimg.tw/ainycka0815/1509631042-433692659.jpg"
    },
    {
      "名稱": "迎曦門",
      "AreaCode": "10018010",
      "地址": "新竹市東門街中正路交叉口",
      "備註": "迎曦門（東門城）是竹塹城僅存的城樓，為國定古蹟。迎曦門城樓下段稱為城座，以條形花崗石石塊疊砌而成，城門洞為圓拱形，是城市的出入口；上層城樓原為木構造建築，現已改為混泥土造，城樓結構共二十四根立柱，屋頂部分為歇山重簷式構造，屋脊的起翹短而有力，以顯示威武的氣氛，城門前豎有石碑一座，為竹塹築成歷史的紀錄，城門前的廣場又稱「新竹之心」，為一個結合傳統與現代科技的市民廣場，是新竹文化的象徵地標。",
      "src": "https://view.boch.gov.tw/NationalHistorical/Images/Items/middle/OA09602000313.jpg"
    },
    {
      "名稱": "護城河",
      "AreaCode": "10018010",
      "地址": "新竹市區林森路至世界街口",
      "備註": "新竹市護城河從火車站經東門城到世界街，全長約800公尺，寬約56公尺的護城河是台灣僅存城門與護城河原址保留的珍貴歷史風貌，河畔周邊充滿人文氣息，與舒適的綠意步道，沿著河畔可漫遊市區欣賞日據時期古建築群。",
      "src": "https://www.taiwan.net.tw/pic.ashx?qp=1/big_scenic_spots/pic_10869_1.jpg&sizetype=3"
    },
    {
      "名稱": "新竹公園",
      "AreaCode": "10018010",
      "地址": "新竹市東大路一段2號",
      "備註": "新竹公園佔地18公頃，舊稱中山公園，又名公二公園，創建於西元1916年。新竹公園距離火車站只有十分鐘的路程，是新竹市民休閒運動的最佳去處，公園內綠樹成蔭，蒼松翠柏，還有玻璃工藝博物館、玻璃工坊、麗池、湖畔料亭、大沙坑、體育館、田徑場等，兼具休閒、運動、人文、歷史機能。",
      "src": "https://www.taiwan.net.tw/pic.ashx?qp=1/big_scenic_spots/pic_10869_1.jpg&sizetype=3"
    },
    {
      "名稱": "新竹市立動物園",
      "AreaCode": "10018010",
      "地址": "新竹市博愛街111號",
      "備註": "新竹市立動物園創園於1936年，為全台現址最老也最迷你的動物園，也是新竹市充滿著歷史記憶重要的休憩地點。108年底改建後的動物園擁有兩大核心目標，首先是以動物生活福祉為優先，除了打造類棲地環境，讓動物生活場域更寬廣，動線設計也以「不打擾動物」為原則；第二，則是讓園區成為最適合親子的「生命教育場域」，讓新竹市不只有一群快樂的動物，更有一群友善動物的可愛市民。",
      "src": "https://www.taiwan.net.tw/pic.ashx?qp=1/big_scenic_spots/pic_10869_1.jpg&sizetype=3"
    },
  ],
  '美食': [
    {
      "名稱": "新竹水潤餅",
      "網址": "https://www.facebook.com/profile.php?id=100063955144117",
      "電話": "(03)5243708",
      "AreaCode": "10018020",
      "地址": "成功路326號",
      "備註": "外地人乍聽「水潤餅」的名字時，會以為是潤餅的一種，其實水潤餅和潤餅完全是兩回事。它是許多新竹人從小吃到大的「古早零嘴」，早期新竹還有多家製作水潤餅的店，然而隨著時代變遷與利潤降低，這簡單樸實的老味道也漸漸凋零，如今新竹只剩下「德龍商行」仍持續販售。德龍商行的二代老闆楊水龍，從國中開始跟父親學做水潤餅，兩代經營至今已超過50年。水潤餅外型圓扁，形狀不太規則，餅皮有斑狀的火痕，原料一如其單純的外型，只有麵粉、水、糖、鹽和肉桂粉；因為不含人工添加物和防腐劑，只能保存3至4天，冷凍能保存半年。楊老闆說：「外地類似這樣的餅都做得像山東大餅一樣，又乾又硬，跟我們的水潤餅不同。」水潤餅的水份較多且軟軟的，類似台語的「水軟水軟」，因而得名。咬一口水潤餅就會發現它不僅軟Q易入口，還帶著一點鹹甜麵粉香的濕潤口感，與傳統大餅的酥脆完全不同，成了早期老人和小孩最愛的點心。撕開餅皮，大大小小的氣孔，淡淡的肉桂香從中散開，滋味雖不濃郁，卻引人入勝，適合作茶點。說起自家水潤餅之所以成為新竹特色美食之一，楊老闆笑說：「因為城隍爺有保佑」。原來大約40多年前，一群在城隍廟服務的志工阿嬤將水潤餅做為獻給城隍爺的供品，此後水潤餅便逐漸興起，更因此成為「平安餅」；每逢農曆七月中元節，新竹都城隍廟范謝將軍遶境出巡時，都會將水潤餅用紅線穿成串，綁在神將身上，供信眾求食保平安，「用水潤餅作為平安餅」的風俗也成為新竹獨一無二的文化傳統。隨著飲食習慣的改變，水潤餅逐漸被人遺忘，年輕一輩新竹人，對這種廟會食品恐怕也僅存朦朧印象。市府在推動「新竹好物」美食復興計畫時，市長林智堅想起了水潤餅，特別推薦，希望更多人認識新竹在地獨特的日常美味。現今年輕人也開發出許多創意吃法，例如把這款古早味零嘴夾上餡料，包上肉末、荷包蛋，或者塗上果醬、咖哩，起司，都有令人驚豔的口感。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "彭成珍餅舖",
      "網址": "https://www.pengpastry.com.tw/",
      "電話": "(03)5224877",
      "AreaCode": "10018020",
      "地址": "西安街5巷21號",
      "備註": "推薦菜色：花生糖派對(原味、綜合堅果)、竹塹餅、麻糬紅豆Q餅、新竹椪餅，若非熟門熟路，一般人可能不知道狹窄的西安街巷裡，有一家傳承三代的傳統糕餅老舖─彭成珍。80多年前，彭成珍阿公以製作傳統糕餅維生，當時賣竹塹餅、柴梳餅等漢餅，每到節慶，也做些應景糕點，像新年的寸棗、中秋月餅、初一十五拜拜的紅龜粿等，主要批發給柑仔店，建立一定口碑。第三代的彭垂明原服務銀行界，從小跟在父母身邊幫忙，每逢中秋大月製餅人手不足時，總得請假幫忙，每見父母常沒日沒夜忙碌，一天睡不到幾小時，加上年紀大了體力明顯變差，決定辭掉工作，返鄉扛起家業。接手後彭垂明發現，消費者飲食習慣改變，看著老顧客逐漸凋零，吃傳統漢餅的人越來越少，開始思索如何突破困境；他先從產品包裝設計著手，也加入品牌行銷的概念，逐漸讓「彭成珍餅舖」名號被更多人看見，拓展消費群，轉型成功後，連太太李虹瑤也辭職投入家族事業，兩代人全心守護這家老餅舖。除了傳統糕餅，彭垂明夫妻倆都愛吃花生糖，常自己製作，並分享給同事，因為不錯吃，口碑建立，同事們起鬨要團購，意外成為人氣商品；在大賣場看見一桶桶的綜合堅果，也讓彭突發異想，將堅果加入花生糖中，作出口感更豐富的堅果花生糖；看著堅果、花生在熱鍋裡相互擁抱跳舞的模樣，將產品取名「花生糖派對」，傳達熱鬧、歡愉的心情，這項產品香脆不黏牙，獲選2016新竹市竹好呷類商品。（「花生糖派對」屬季節限定商品，夏天天氣過熱，麥芽糖無法凝固，端午節至中秋節期間不販售）。兩代人做傳統竹塹餅、柴梳餅、新竹椪餅，第三代研發花生糖派對，讓彭成珍餅舖在傳統之外，也開發新品，為這巷弄裡的三代店，點燃邁向下一世紀新餅業的燈火。",
      "src": "https://www.pengpastry.com.tw/shopping_goods_img/6/6.jpg"
    },
    {
      "名稱": "淵明餅舖",
      "網址": "http://www.yuanming.com.tw/",
      "電話": "0952170115",
      "AreaCode": "10018020",
      "地址": "中山路112號",
      "備註": "推薦菜色：肉燥水蒸鹹蛋糕、風味芋頭餅、冰立方吐司；滷肉燥搭鬆軟蛋糕，在口中會撞出怎樣的火花？那份飽含肉香的鹹味與麵粉香的微甜，咀嚼之後留在舌尖的感動，會讓你回味無窮；這款糕點正是新竹知名的淵明水蒸蛋糕，曾獲選新竹十大伴手禮。位於中山路城隍廟對面的淵明餅舖，已有70年歷史，創辦人楊深淵老先生早年利用美援物資，單純以麵粉加蛋和糖，做出口感綿密、口味清爽的水蒸蛋糕，為新竹美食補上一頁。水蒸蛋糕發跡於新竹大戲院、樂民戲院交叉路口，那是早年新竹北區最繁華的商圈之一，楊老先生在路口設攤，每到週末假日電影開演前，就是楊家人最忙的時候，熱騰騰冒著煙的蒸糕，飄散出迷人香氣，挑起觀眾的食慾，之後一傳十、十傳百，成了新竹人看電影時非買不可、最夯的點心。第二代老闆楊滉崇從小為了家務，幫忙劈柴、挑水、生火，在煙霧迷漫的廚房工作，他說，水蒸蛋糕於他，就像家人一般熟悉，不可或缺，也是他人生記憶的全部。水蒸蛋糕的製作過程看似簡單，卻需慢工細活，每塊蛋糕先鋪一層底，分別放入紅豆、芋頭和肉燥內餡，上面再鋪一層蛋糕，才能進爐蒸，「火候掌控很重要，表皮要維持一定的濕度。」他說，製作時間超過一個半小時；他遵循傳統古法，只用蛋、糖、麵粉三種原料，製程中不加一滴油或香料、色素、防腐材料，要讓消費者吃得健康又養生。楊老闆對食材相當堅持，甜味水蒸蛋糕裡的「紅豆餡」，選用顆粒大、皮薄、顏色鮮紅的國產紅豆，「芋頭泥」也用上好芋頭，切塊、熬煮後，撈起來呈現淡淡紫色；店裡招牌是肉燥水蒸鹹蛋糕，加了滷肉燥的餡入口難忘，淵明水蒸蛋糕質地綿密鬆軟、爽口不油膩，如搭配冰涼沙士，甜甜鹹鹹的台式風味，會讓你一口接一口！目前，第三代楊志安也加入營運，為傳統老店走出新風格，他愛吃麵包，開發新品牌「十方吐司坊」，以老麵長時發酵，只用鮮奶不加水，做出鮮奶吐司入口即化又Ｑ彈，手按壓後即恢復原形，也快速竄紅成為超人氣商品！",
      "src": "https://bankofculture.com/wp-content/uploads/2019/09/-e1567599897986.jpg"
    },
    {
      "名稱": "新復珍商行",
      "網址": "https://www.hfj.com.tw/",
      "電話": "(03)5222205",
      "AreaCode": "10018020",
      "地址": "北門街6號",
      "備註": "推薦菜色：竹塹餅、柴梳餅、核桃酥餅、水蒸蛋糕、美祿柑、綠豆椪，有一種餅，作家焦桐說它的滋味是「輕淡的甜蜜含蓄著輕淡的鹹，鬆，軟，香，那滋味在口舌之間，纏綿，深情，像戀人的吻。」文字間的雋永意蘊無法一一道出，但繾綣之感彷彿融入腸胃與心底，久久不散。這是竹塹餅，以新竹古城為其名的特色糕點。竹塹餅創辦人吳張換女士原本在城隍廟前賣肉粽，1898年，年僅20多歲的她在新復珍的現址開始經營糕餅舖，巧妙地將包肉粽的蔥香、料香、豬油香應用到糕餅上，成了顧客最愛的口味，廣受歡迎；本來稱為肉餅或糕皮餅，但因為外地人常說「要買竹塹城的那個肉餅」，「竹塹餅」之名因而流傳開來。「新復珍」第四代吳紘一接手後，堅守最初的手工做法，現今需求量大增的竹塹餅，仍是老員工們純手工捏製而成。竹塹餅最重要的食材是豬板油和油蔥；吳紘一說，採用的是新竹本地的黑毛豬製成的豬板油，加上自己剝製、切、炸的油蔥，不同於一般外面工廠的機器製作，不但味道更香，內餡軟加上外皮酥脆，成就新復珍的百年好品牌。竹塹餅也是新竹人的共同記憶，曾有嫁到外縣市的女顧客回來新復珍買餅，開心地跟店員分享︰「我從小吃你們的竹塹餅吃到大」，言談之間，對於竹塹餅的驕傲和喜悅表露無遺。因為餡料和口感特殊而享有盛名的竹塹餅，近年因應民眾口味的改變也做了調整；現今的竹塹餅保留了漢餅精神中甜中帶鹹的豐厚味道，內餡已見不到早時白白的豬油塊，只保留下濃郁的豬油香，符合現代人少油膩、輕口味的需求。此外又推出了「小竹塹」，讓竹塹餅更精緻、討喜。每年節慶前後也是竹塹餅購買的旺季，在地人以竹塹餅當作禮品，送禮自用兩相宜，至今這股風氣不僅持續盛行且不斷往外擴散，提供外縣市民眾選購餅食糕點的多元選擇，也讓這纏綿的幸福繼續傳承下去。",
      "src": "https://api.joybon.net/rest/file/image?path=001/venderBg/451115500211011584.jpg"
    },
    {
      "名稱": "光華冰果店",
      "網址": "https://www.facebook.com/kwanhua35",
      "電話": "(03)5322318",
      "AreaCode": "10018020",
      "地址": "光華東街35號",
      "備註": "推薦菜色：綜合冰、四果湯、銀耳蓮子湯，在許多新竹人心中，「光華」是記憶中陪伴成長的一家老冰菓室，老闆張琮和說：「很多客人學生時期開始光顧，結婚、生子、甚至到外地打拚多年後，還會攜家帶眷回來，回味年輕時代的滋味！」店家始終如一的執著與堅持，讓純粹的「老」味道，牽動外地遊子的心。藥劑師轉行的老闆張琮和，以頂真的態度和不斷研發創新的精神，認真處理每一道冰品的工序，例如：用熱「悶」法讓每樣食材達到恰如其分的口感，像紅豆以快鍋煮熟，悶30分鐘後立即加糖，讓粒粒紅豆入味，綠豆煮半熟即關火靜悶，讓綠豆保留完整外貌，口感綿密；看似簡單的糖水，竟結合兩種糖，加上繁複工序，首先將二號砂糖炒出蔗糖香氣，加入較甜的白糖拌炒，交融出香、味兼具的糖水.....，種種好吃的食材，全憑高度實驗精神累積出經驗值，讓光華的甜品味道了得。除了對食材用料的執著，冰果店品飲空間也絲毫不馬虎，雖是40年老店，裝潢設計依然新意盎然；「做一行得像一行」，張琮和認真地說，為了給客人舒適的飲品環境，幾乎每兩年店內裝潢都重新整修，讓客人保有新鮮感。凡事都愛嘗試的張老闆，空間設計也不假他人，巧妙利用鏡子返照與透視，營造出寬敞的空間感，連牆上馬賽克的拼貼也獨到，呈現他理想中的質感。張琮和慎選食材，且不限定產地或品種，全依季節時令挑選出最優質、最合宜的食材來製作，發揮當令食材的特性，也因為堅持所有配料當天熬煮製作，每一款冰品甜湯，都具絕佳口感與風味，讓客人感受老冰菓室的心意。",
      "src": "https://images.deliveryhero.io/image/fd-tw/LH/b8fa-hero.jpg?width=512&height=384&quality=45"
    },
    {
      "名稱": "樹林頭麵店",
      "網址": "",
      "電話": "(03)5314945",
      "AreaCode": "10018020",
      "地址": "東大路二段423號",
      "備註": "推薦菜色：陽春麵、榨菜肉絲麵、滷味拼盤，樹林頭麵店是時代的座標，讓過去的記憶降落，讓現在的人們見證歷史。「我老公以前隸屬空軍第八大隊，是支轟炸大隊。」我們進店時，91歲的常客姚奶奶正和老闆聊得起勁。原來，麵店老闆李增水以前是空軍第三十四大隊的士官長，跟老奶奶有說不完的話題；其實，東大路這一帶以前有許多空軍眷村，一旁的鐵道路顧名思義是以前火車軌道，專門載送貨物直達機場。樹林頭麵店始於民國63年，由老闆娘周雲玉的媽媽創立，因應外省人飲食習慣，經營麵食早餐，菜色說起來稀鬆平凡，盡是處處可見的陽春麵、榨菜肉絲麵、炸醬麵、滷味，但光憑這幾樣菜就能收服許多人的胃，可見店家功力。店裡的招牌是「辣椒醬」和「山東醋」，正是老眷村人念念不忘的味道，「這些外面買不到，很多人搬到台北後特別回來吃。」周雲玉說；辣椒醬用的是花椒，香而不嗆，略帶辛辣；山東醋清淡爽口，不似市面上賣的醋那麼酸，兩種醬料搭在一起是絕配，淋在各類麵食、滷味上，都讓麵點加分，「這是老外省人的口味，年輕人不知道，但我這麼一教，大家都說好吃！」周雲玉笑說。滷味拼盤是店裡的另一項人氣產品，經常早上10點前就銷售一空，其中，最受歡迎的莫過於豬頭肉和豆腐干；豬頭肉經小火熬煮1∼2個小時，油脂消失，軟硬適中，老闆娘每天都要吃上一份，豆腐干裡頭有孔洞，能讓湯汁入味，滷得到味，咬下去滷汁溢出，口感鬆軟又香氣飽滿。樹林頭麵店走過四十多個年頭，老闆夫婦見證了老主顧的成長與凋零，與客人也成了無話不說的朋友，「我喜歡看老客人，跟他們一起聊聊老故事或八卦，相當有趣。」老闆娘笑著說，她也希望這家店成為社區交誼廳，繼續經營下去，將棒子交給兒子。仗打完了，眷村拆了，當時的記憶結晶成一碗碗湯麵，道道滋味都是大時代矇住的心跳。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=30&module=travel&detailNo=1178539399801999360&serno=829e00cf-2fb4-4720-826a-888e39d3afc4&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "揭家牛肉麵",
      "網址": "https://www.facebook.com/profile.php?id=100064171261590",
      "電話": "(03)5364668",
      "AreaCode": "10018020",
      "地址": "東大路三段373號",
      "備註": "推薦菜色：牛肉麵、牛肉乾麵、豬骨湯腸麵、各式滷味，「揭家牛肉麵」開業已六十餘年，是新竹知名老字號，許多常客從小吃到大。店面鄰近南寮漁港，人潮絡繹不絕，是在地人難以忘懷的家鄉美味。揭家牛肉麵主要供應乾麵、湯麵及無肉牛肉湯麵，另有陽春麵及搭配滷大腸的牛骨、豬骨湯腸麵等，麵食品項單純，但櫃台上擺著的一大盆滷味，卻令人垂涎欲滴，每樣都想來上一口。早期的東大路與武陵路、鐵道路周邊，是空軍眷村，鄰近空軍聯隊基地，來自大陸各省的眷戶，常會烹煮家鄉味與鄰居分享。揭家第一代老闆揭奶奶1950年代，在眷村開牛肉麵館及滷味店，村裡人待客，習慣到「揭家」切點滷味；第二代揭強中國海專畢業後，原打算跟商船出海，但因身為家中獨子，姊妹們又旅居國外，選擇留在家中照顧父母，也跟著母親學習煮麵、滷牛肉技藝，接手後，天沒亮就得起床，一做也四十多年。「揭家」經典牛肉麵是紅燒口味，基底是以牛骨長時間熬煮成的濃白高湯，加上糖、鹽、醬油、薑、八角等調味料，再將澳洲牛腩滷至軟嫩入味，湯頭看似濃稠，其實爽口，入口滿是牛肉鮮香。店內使用的麵條也十分講究，早年都用眷村鄰居手工揉製、攤車叫賣的麵條，現在改用原供應店家、品質一致的產品，讓開業的好味道至今不變；不吃牛肉的客人也有好選擇：豬骨湯腸麵，這是應當時空軍基地常客的要求而做的，湯頭以豬大骨熬製，配上煮好的麵條及口感Q軟的滷肥腸，愛吃肥腸的人肯定欲罷不能。使用老滷汁烹製的滷味堪稱佐餐良伴，包括：豬頭皮、豬腳、豬腸、豬肚、牛腱、牛肚、牛筋、鴨翅、鴨胗、鴨蛋等，種類豐富，顧客選好喜歡的品項後，老闆娘會幫忙秤重、切盤，滷味直接吃就很美味，也可搭配山東醋、店家自製辣油、蔥白，調配沾醬，後勁十足的辣味，搭純釀山東醋的溫和酸味，嘗起來更加爽口。",
      "src": "https://bjsmile.tw/wp-content/uploads/flickr/8992930408_2b3d6ea909_z.jpg"
    },
    {
      "名稱": "漁香甜不辣",
      "網址": "https://www.facebook.com/YuHsiang.Hsinchu/",
      "電話": "(03)5238843",
      "AreaCode": "10018020",
      "地址": "大同路86號2010號",
      "備註": "推薦菜色：原味甜不辣、鹽酥甜不辣、綜合飯、牛蒡甜不辣，深受在地人喜愛的「漁香甜不辣」，以新鮮、純正的魚漿原料製作，不加人工添加物，備受消費者肯定。「漁香」已傳承三代，第一代經營者是東門市場內的小魚舖，因每天採購的新鮮魚貨總會剩下一些，不想浪費，開始製作魚漿，沒想到大受好評，後來轉型專賣魚漿，新竹不少小吃店都向他們買魚漿，再自行加工製成其他產品出售。「漁香甜不辣」專賣店原在中央路上，只賣原味甜不辣、鹽酥甜不辣和幾樣冷凍魚漿製品，兩年前遷到大同路現址，室內面積擴大，用餐環境也變寬敞，菜單內容較多元，除了基本魚漿製品，增加飯、麵主食和多款小菜。身為長男的第三代老闆陳昱府，年輕時便知道自己須扛起家業，為了讓家傳的魚漿生意能永續經營，接手後，從甜不辣專賣店起步，講究新鮮與衛生的態度，做出口碑後，轉大同路擴大營業，從店面規劃、裝潢到擬菜單，大小事都親力親為，力求打造出明亮衛生、顧客舒適用餐的空間。招牌甜不辣原料簡單，每日現做，基底魚漿在東門市場一樓的老舖每天現絞，再送到二樓工廠成型，現炸成各式甜不辣；甜不辣有魚棗、魚條、魚餅三種，魚漿中分別加入雞蛋、豬肉、洋蔥，吃得到魚漿的鮮味與彈性，新口味牛蒡甜不辣可以酥炸後當小菜，鹹香滋味加上碎牛蒡的清脆口感，值得一試。佐餐的包餡魚丸湯，魚丸裡加了豬肉、青蔥、荸薺、鹽、糖拌成的餡料，由師傅們以熟練的技術手捏成型後下水烹煮，與高湯一同享用，口味特佳。「漁香」所有產品都不使用多餘人工添加物，因此不耐久煮，為了讓顧客享用最佳口感，每一份都得下單後現煮，如果覺得不過癮，順手帶幾包冷凍魚棗、魚條、魚餅或包餡魚丸，回家DIY，也是不錯的。",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=30&module=travel&detailNo=1178542983302090752&serno=42be8d30-439c-49eb-a5a1-9bb6b6a1f984&type=pic&init=N&preview=&aplistdn="
    },
    {
      "名稱": "竹樂食堂",
      "網址": "",
      "電話": "(03)5340996",
      "AreaCode": "10018020",
      "地址": "西大路690號",
      "備註": "推薦菜色：古早味蚵仔煎、烤排骨、紅燒魚皮、黑米糕，位於民富國小對面的竹樂食堂，是老牌熱炒店，開店30年來，從不用菜單，如同一般海產店，客人先在門口冰櫃前選擇想吃的生鮮食材，老闆依季節時令來配菜，因此，即便是一樣的生鮮，配的青菜都不一樣。說到竹樂食堂，新竹市老一輩人一定豎起大拇指，創店老闆陳國龍已76歲，他年輕時學廣式、福州料理和酒家菜，曾和友人在大同路開大春餐廳22年，民國76年到西大路開店，以家常熱炒為主，菜色都自行研發，目前已由第二代陳順溢、李靜居接手，不過，陳國龍還親自採買，「食材新鮮，才做得出好料理」。「歷任市長都來過，住附近的柯文哲家人也常來」老闆娘說，來店的熟客多，雖沒菜單，熟客也都信任，像白斬雞、古早味蚵仔煎、烤排骨、紅燒魚皮、黑米糕、土魠魚羹湯等，都是店裡招牌；尤其蚵仔煎、烤排骨點食率最高，這兩道菜食材單純、做法簡單，卻有讓人一吃再吃的魅力。古早味蚵仔煎是將鮮蚵汆燙後，加入青蔥和地瓜粉，入鍋煎至兩面金黃酥脆才上桌，滿滿的蚵仔，咬下去外酥內軟，百吃不厭；烤排骨也只用簡單的調味料醃過，放入200度烤箱中烤20分鐘就完成，肉排軟嫩多汁、還有嚼勁。「我們的料理方式都很簡單，重點在掌握食材的新鮮度」陳順溢說，對食材有信心，才敢放在透明冰櫃讓客人選。竹樂食堂沒有豪氣的裝潢，空間也不大，但消費者仍願意造訪的另一原因是竹樂食堂童叟無欺，價格親民。30年來，從廚房料理到外場服務，全由竹樂食堂家族親力親為，很多食材也是親戚朋友自己栽植的，「清楚食材來源，才吃得安心」老闆娘說，這也是竹樂食堂開店的初衷。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "蔡記燒酒雞",
      "網址": "",
      "電話": "(03)5233885",
      "AreaCode": "10018020",
      "地址": "中正路190號",
      "備註": "推薦菜色：藥膳燒酒烏骨雞、金錢蝦、里肌糖醋肉、墨魚香腸，台灣到處都有燒酒雞，但新竹市「蔡記雞酒燒」這家25年老店，讓人印象特別深刻！店名「雞酒燒」發想自台語「燒酒雞」，老闆蔡思涵故意將店名反著取，看得出他反骨的個性與趣味，反映在菜色設計與創新上，也大不相同。蔡記雞酒燒的店面不大，沒事先訂位，向隅機率很高，雖然價格不便宜，卻經常高朋滿座，原因是蔡思涵比客人嘴刁，自己不吃的也不會給客人吃！他認為，開店不是有得賣、賺錢就好，要有自己的標準，「餐飲業是良心事業，貴也要貴得有道理」。以店裡招牌藥膳燒酒烏骨雞來說，半隻雞要價近千元，硬是比一般燒酒雞貴上許多，原因在於他使用的滷包，除了特別調製的中藥配方，最重要一味是加了一斤上萬元、精磨成粉的冬蟲夏草，光這味成本就不低，但為了讓燒酒雞食補功能發揮到極致，「再貴也省不得」。這道招牌雞湯選用營養價值、口感都屬上乘的烏骨雞，重量也錙銖必較，太小沒份量、口感差，太大肉質過柴、纖維太粗，唯有精選的4斤重，才能完美呈現蔡記招牌。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "阿富魯肉飯",
      "網址": "",
      "電話": "(03)5254305",
      "AreaCode": "10018020",
      "地址": "中山路75號",
      "備註": "推薦菜色：魯肉飯、摃丸湯、肉羹湯，深夜時分，城隍廟口前，一家亮著橘黃小燈的攤位上，食客來來往往，燈下混合了蒸氣與香氣的光影，讓夜歸人感受到溫暖，不自覺停坐下來，嘗嘗魯肉飯與肉羹湯。這店是阿富魯肉飯，民國79年，創辦人陳金連女士為了餵飽自己的五個孩子，在當時北部還不盛行魯肉飯時，跟左鄰右舍請教魯肉飯做法，找到廟口一隅，便做起生意，如今成為竹塹城的深夜食堂。「一開始連個招牌都沒有」，不過因為營業到半夜，加上魯肉飯選用的肉塊跟其他魯肉飯店不同，做出特色，也成功打響知名度，幾年後才以孩子名字中的「富」字，取名「阿富魯肉飯」。「阿富魯肉飯」好記又庶民，如今已傳到第二代，由老么邱彥貴和姊姊一起經營；邱彥貴如實傳承了母親堅持的古早味及創業理念：「用最經濟實惠的價格把大家餵飽」，除了口味不變，魯肉飯、筍絲、油豆腐或湯品價格，也都十分親民。他說，廣受青睞的魯肉飯維持母親古法，肉塊肥瘦比約7比3，肥肉選豬的肩頸肉，瘦肉是前腿肉，採兩段式滷製法製成，滷第一次時，先將豬肉、砂糖、鹽、醬油及特製滷包，放入大鍋，加水烹煮約一小時，過程中須不斷攪拌，讓受熱和調味料均勻分布，待肉熟後，蓋上鍋蓋悶半小時；第二次滷時，先把滷汁上油脂瀝掉，再加水攪拌約四十分鐘，滷出來的肉塊，不僅有豬肉的膠質和彈性，且入口即化、粒粒分明，滷肉塊與湯汁淋上白飯，再灑一點中藥房磨製的黑胡椒粉，造就了阿富魯肉飯的美味，每天可賣出6、7百碗。「我和小孩也愛吃魯肉飯，賣給客人的一定是我們自己喜歡吃的。」邱老闆每天一早送小孩上學後，開始備料工作，因為有三家店，一整天要準備8到10鍋的滷肉和小菜食材，再分送到各店面，相當辛苦，不過，當飯菜送上桌，看到客人露出滿足的笑容、讚不絕口時，生活中幸福的醍醐味，也自然散發出來。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "三福麵線",
      "網址": "https://www.facebook.com/profile.php?id=100054638641811",
      "電話": "0987875333",
      "AreaCode": "10018020",
      "地址": "竹光路214號",
      "備註": "推薦菜色：蚵仔大腸麵線、三福麵線、牛肉麵線，乾淨衛生的環境、舒適自在的氛圍與道地台灣家鄉味，顛覆一般人對傳統小吃的刻板印象，「三福麵線」讓旅人留下深刻印記。在白色為基調的溫馨木質空間，聆聽輕鬆音樂，享受古早味小吃蚵仔大腸麵線，相當療癒，連鴨血、牛肉等食材，也都能加進麵線裡，這份驚豔，讓人發現庶民小吃：麵線的百搭特質。老闆娘在新北市三重長大，這座與繁華台北市僅一橋之隔，許多北上打拚外地人落腳的城市，匯聚眾多中南部引進的南方味小吃攤，麵線攤尤其多，「當時的三重，三兩步就一家麵線攤」，她從三輪車麵線攤吃起，記憶中那是早晚必嘗食物，嫁作新竹媳婦，卻遍尋不著家鄉的麵線味。2008年，老闆娘與友人合資創業，兩個餐飲業門外漢，選擇以成本較低的麵線入手，在城隍廟邊的小店開業，憑藉家庭主婦挑嘴的特質，找到家鄉麵線烹調最佳手法，2013年4月遷店竹光路，因為媒體報導，名氣大增，生意大好，即便下午才營業，主廚卻得清晨開始備料。三福麵線的湯頭色澤特別深，常有客人問為什麼？老闆娘笑笑說，因為「忠於記憶中的家鄉味」。原來，製作湯頭大有學問，老闆娘利用汆燙蚵仔的大鍋湯，加入獨門秘方熬煮而成，保留蚵仔麵線最甜美的原汁原味，絕不加味精，讓人吃得美味又安心。麵線的兩大配角是：蚵仔與大腸，食材的選擇、處理與烹調是大學問。鮮甜飽滿的海蚵，專程到南台灣尋找老字號的養蚵人家，保持海水浸泡宅配，烹煮前才開箱，保留大海天然的鹹甜香，大腸僅以白醬油加少許八角滷製，呈現食材原味。豬大腸的處理更講究，她選用品質保證、當日新鮮的豬大腸，先用大鍋沸水汆燙去血水，再徒手將每條大腸仔細翻面、剪除內層油脂再翻回來，之後用白醬油滷製去味、吹涼、分裝，這麼「厚工」費時，只為讓客人吃到沒有腥味、有著不油不膩嚼勁的豬大腸。麵線雖是庶民小吃，要煮得好吃需要功力。老闆娘說，三福曾被科學園區的工程師封為「麵線界的LV」，能得到這樣的評價，正是店家對自我品質的堅持。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "老店薑母雞",
      "網址": "https://www.facebook.com/profile.php?id=100064301010536",
      "電話": "(03)5284895",
      "AreaCode": "10018020",
      "地址": "少年街51號",
      "備註": "推薦菜色：招牌薑母雞、狀元雞，「婆婆做薑母烏骨雞幫我做月子、補身體，因緣際會成就了這家店。」女主人李小珍感性地說出婆媳間感人的互動。老店薑母雞民國92年創店，當初主打「烏骨雞」同業都不看好，認為悖離傳統，沒想到卻異軍突起，創造佳績。「其實，烏骨雞比鴨肉更適合女性，很多顧客都用我們的薑母雞做月子。」李小珍說。薑母雞主要材料是老薑和烏骨雞，老薑搗碎加入中藥材炒香，與炒過的烏骨雞肉做成主湯底，搭配客人點食的各式配料，湯頭愈煮愈甜，而薑的辛辣溶入湯底，增添口感，連老薑本身都變得好吃。店裡用的老薑來自南投縣，烏骨雞則是經檢驗認證的農場長期供應，店裡還張貼了所有材料產地證明，讓顧客吃得安心。目前店裡供應五種湯底：薑母雞、薑母鴨、首烏雞、淮蔘雞、狀元雞，前四種湯底都屬溫補鍋，新開發的狀元雞是養生鍋，以烏骨雞、鮑魚片、茶樹菇、羊肝菌菇等溫補食材為主，因菌菇類有豐富多醣體，適合四季吃或不想吃過燥補鍋、注重養生的顧客選用，所有湯底中，薑母雞點食率最高。李小珍也重視主鍋配料的選材，每天早上6、7點就到市場備料，「新鮮是第一原則」，絕不濫竽充數，也不以多元取勝，不適合補鍋湯底的配料如：茼蒿菜、麻糬燒等火鍋料，因口感不對，都不採用。至於搭配的麵線，則選用有四十餘年歷史的宏廣製麵廠生產的麵線，口感Q滑不軟爛，淋上自製蔥香油和少許豆腐乳沾醬，有獨特的香氣和口感，也是老店薑母雞必嘗的一味。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "鴨肉許",
      "網址": "",
      "電話": "(03)5253290",
      "AreaCode": "10018020",
      "地址": "中正路212號",
      "備註": "推薦菜色：鴨肉湯麵、炒鴨血、燻鴨肉，厚實的木砧板上不斷傳來剁鴨肉的低沉咚咚聲，暱稱「二姊」的許美惠剁鴨肉的手沒停過；從小到大，她跟在父親許文河身旁，看著父親剁鴨肉的身影長大。兩代人在鴨肉、砧板刀起刀落間忙碌著，一晃眼就是50年。靠著賣煙燻鴨肉，許文河養大一家人；出身彰化鹿港的他，在新竹最初賣的並非鴨肉，而是家鄉味麵線糊，十幾歲到台北餐廳當學徒，看著師傅烹煮鴨肉的歷程，累積鴨肉料理竅門，再調整口味，最後琢磨出一套煙燻鴨的方法，將煙燻過的鴨肉加到切仔麵裡，當他端出第一碗風味獨特的鴨肉麵時，讓客人驚豔，一炮打響名號，這麵也成了「鴨肉許」獨家招牌菜。熱情好客的許文河以自家姓取店名「鴨肉許」，從最初的推車擺攤，累積出一批死忠顧客，逐漸在新竹闖出名號，中正路開店後更成熱門商店，朋友送了他一塊匾，題名「日理萬鴨」，名副其實；如今「鴨肉許」擁有中正路、北門街與西大路3間店面，分由三個女兒打理，每天平均要賣上百隻鴨子，新竹在地人最愛光顧的，是二姊許美惠掌舵的中正路總店。煙燻鴨肉是「鴨肉許」的主角，衍生出鴨肉湯麵、炒鴨肉麵、鴨肉飯、炒鴨血等料理，煙燻鴨肉的好壞，決定了所有料理的口感；「鴨肉許」選用4∼4.5斤重的土番鴨，這樣大小的鴨肥瘦合宜，有足夠的油脂，皮厚質細，肉纖維不會太粗、太老；鴨隻洗淨、蒸熟後，放入加了甘草等20多種中藥材的滷湯裡浸泡入味，再以白糖煙燻上色增香，可口的煙燻鴨肉於焉完成。可別小看煙燻的每個步驟，正因為以炊蒸取代水煮、用浸泡方式入味，鴨肉肉汁不致流失，口感更顯溫潤，鮮度與甘甜度也大大提升，上菜前再淋灑一匙蒸鴨時收集的原汁，鮮美的味道如畫龍點睛，讓整盤煙燻鴨肉更增餘韻、悠長而濃郁。這樣有滋有味的煙燻鴨，讓人吃起來嘴巴、手指頭滿是煙燻香，鴨肉汁不經意地從嘴裡往指尖流淌，叫人忍不住貪戀地吸吮起來，此刻，「吮指回味」已不只是形容詞，活脫脫成了饕客們賞鴨的美味動詞呀！",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "西市汕頭館",
      "網址": "",
      "電話": "(03)5244430",
      "AreaCode": "10018020",
      "地址": "西安街70號",
      "備註": "推薦菜色：火鍋、炒沙茶牛肉麵、祖傳特製沙茶醬、牛雜湯，從城隍廟口轉到廟旁的西門市場，沿著小巷弄往前走，不仔細找，或許就錯過這家屹立新竹近70年的老字號店家─「西市汕頭館」。從民國38年創立，至今已傳到第四代，店也擴展到3家。走進老店內，馬上聽到熱情招呼聲；雖然過了午餐時間，店內仍有客人，黃家四兄弟家族分工，人人在自己崗位上各司其職，確保品牌的誠信與價值。「西市汕頭館」黃家大哥黃沛峰說，因為父親是校長，從小教導兄弟們一定要和睦互助，不打架、不爭吵、不說髒話，偶而起爭執，也是就事論事，針對食材或營運策略做討論，因此能合作創業迄今，如今他的兒子也開始參與家族事業了。「遵古法」是汕頭館的經營原則，無論食材選擇、料理火候或湯頭，都有一定的堅持，也非全照食譜制式製作，而是以客為尊，依據不同客戶需求、順應潮流，調整口味，目標是永續經營。潮汕料理偏甜，汕頭館配合台灣人的口味做微調，減油、少辣、不加糖，其中，選用新鮮的非冷凍肉，搭配祖傳沙茶醬佐料，不論用在牛肉火鍋、炒沙茶牛肉麵或牛雜湯，都相當可口也是人氣聖品。黃家大哥說，牛肉火鍋的賞味口訣是「肉不離筷、鍋底三秒」，依此口訣，以雙刀法切出來的薄薄蝴蝶狀肉片，在熱湯中，會從鮮紅色轉為淡粉白，入口後，瞬間滿腔軟嫩感與鮮甜香氣。牛雜湯的牛肉選用黏附骨頭上的半筋半肉，加上自製檸檬和獨門香料，熬煮七小時，湯頭看似深濃，嘗來卻清爽，白蘿蔔和牛肉的甘甜融為一體，由於一天僅熬一鍋，是有緣人才嘗得到的私房料理。黃沛峰最享受烹煮菜餚的過程，因為全神貫注，心無旁騖，煩惱盡除；當料理端上桌、得到客人稱讚時，那份成就感，更是不凡！如果你是火鍋或牛肉料理愛好者，路過新竹城隍廟，不妨來西市汕頭館坐坐，嘗一口傳承超過一甲子的鮮滋味吧。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
    {
      "名稱": "余家金城廣東粥",
      "網址": "",
      "電話": "(03)5277412",
      "AreaCode": "10018020",
      "地址": "水田街2號",
      "備註": "推薦菜色：廣東粥、皮蛋瘦肉粥，在中正路與水田街轉角處，毫不起眼的「余家金城廣東粥」，外觀雖老舊，許多新竹人談到吃粥，多數會想到這家店，好味道讓嘗過的人，不自覺豎起大拇指說：讚！「余家金城廣東粥」開業20多年，老闆余健俊早年學習金門廣東粥的煮食秘訣，飲水思源，以金門縣金城鎮為名創業。金門廣東粥屬廣東「生滾粥」，將米粒煮到不見形體，跟台灣的清粥、鹹粥，粥體粒粒分明不一樣。余家廣東粥煮法是先煮一大鍋粥，顧客訂餐後，從大鍋搯出少量粥到小鍋猛火烹煮，依品項加入新鮮肉類、海鮮或動物內臟等主料，稍微煮開後即關火，「這動作是要保持粥內食材的新鮮度」他說，也確保饕客嘗到鮮嫩香滑粥品，這是生滾粥的特色，也成了余家廣東粥的特色。說到自家廣東粥好吃的秘訣，余健俊謙虛地說：沒甚麼啦！除了料好實在，不偷工減料，最重要是確保高湯鮮美！金城廣東粥的湯底有學問，以甘草、當歸、紅棗等多種中藥材，跟雞骨頭一起燉煮超過三小時，聞起來有淡淡中藥香卻不濃烈，雅而不淡，恰分地增添雞骨高湯的厚度與豐富性。湯底有了靈魂，還得用老米來煮，因為老米澱粉含量多，煮起來能產生更多黏性，此外，老米容易吸附高湯，吃起來自然更入味。獨門的中藥湯底，配上濃稠綿細的米粥與食材的鮮甜，口腔裡填滿了豐美的味道，熱呼呼的，身體都暖了起來。",
      "src": "https://uploads-blog.icook.network/2021/08/99b2e158-p1.jpeg"
    },
  ],
  '廁所': [
    {
      "公廁編號": "O010000002",
      "名稱": "國泰醫院新竹分院1樓男廁",
      "地址": "新竹市中華路二段678號",
      "備註": "國泰醫院新竹分院",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "福德里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000003",
      "名稱": "國泰醫院新竹分院1樓女廁",
      "地址": "新竹市中華路二段678號",
      "備註": "國泰醫院新竹分院",
      "最新公廁級別": "特優級",
      "公廁類型": "女廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "福德里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000004",
      "名稱": "國泰醫院新竹分院1樓無障礙",
      "地址": "新竹市中華路二段678號",
      "備註": "國泰醫院新竹分院",
      "最新公廁級別": "特優級",
      "公廁類型": "無障礙廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "福德里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000007",
      "名稱": "大遠百威秀影城男廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百威秀影城",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000008",
      "名稱": "大遠百威秀影城女廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百威秀影城",
      "最新公廁級別": "特優級",
      "公廁類型": "女廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000010",
      "名稱": "大遠百(新竹分公司)B1男廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000011",
      "名稱": "大遠百(新竹分公司)B1無障礙廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "無障礙廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000016",
      "名稱": "大遠百(新竹分公司)2樓前男廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000017",
      "名稱": "大遠百(新竹分公司)2樓前女廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "女廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000018",
      "名稱": "大遠百(新竹分公司)2樓前無障礙廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "無障礙廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000019",
      "名稱": "大遠百(新竹分公司)2樓後女廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "女廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000020",
      "名稱": "大遠百(新竹分公司)3樓前男廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000021",
      "名稱": "大遠百(新竹分公司)3樓前女廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "女廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
    {
      "公廁編號": "O010000022",
      "名稱": "大遠百(新竹分公司)3樓後男廁",
      "地址": "新竹市西大路323號",
      "備註": "大遠百(新竹分公司)",
      "最新公廁級別": "特優級",
      "公廁類型": "男廁所",
      "縣市別代碼": "10018",
      "行政區域代碼": "10018010",
      "村里名稱": "南市里",
      "src": "https://www.wowlavie.com/files/article/a0/9584/atl_m_160009584_513.jpg"
    },
  ],
  '公園': [
    {
      "編號": "1",
      "名稱": "湳雅公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組1組、搖搖馬4座、雙人搖搖馬2組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "5",
      "名稱": "樹林頭公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "風兒滾滾來滑草坡1組、沙坑1組、共融式鞦韆組1組、地景迷宮傳聲筒1組",
      "src": "https://images.abic.com.tw/photoDB/post/1519716111.jpg"
    },
    {
      "編號": "6",
      "名稱": "長和公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "磨石子溜滑梯1組、吊橋2組、吊索1組",
      "src": "https://tourism.hccg.gov.tw/chtravel/app/data/image?id=28&module=travel&detailNo=1174272056087285760&serno=b6cb0405-d324-41af-b2b9-905eaae20233&type=pic&init=N&preview=&aplistdn="
    },
    {
      "編號": "7",
      "名稱": "福林公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、搖搖馬4組",
      "src": "https://www.maisonbest.com.tw/ckfinder/userfiles/files/%E6%96%B0%E6%A1%88%E8%B3%87%E8%A8%8A/%E5%AE%B6%E7%9B%8A%E5%A4%A7%E8%88%9C/589881.jpg"
    },
    {
      "編號": "8",
      "名稱": "福林重劃公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "飛機組合遊具組1組、共融式鞦韆組1組",
      "src": "https://bobowin.blog/wp-content/uploads/20221026111758_31.jpg"
    },
    {
      "編號": "9",
      "名稱": "南勢重劃公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "火車組合遊具組1組、雙人搖搖馬1組、單人搖搖馬4組",
      "src": "https://andyhsu-trainer.com/wp-content/uploads/2023/09/S001-11.jpg"
    },
    {
      "編號": "10",
      "名稱": "蟹仔埔公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯2組、單人搖搖馬6組、雙人搖搖馬1組",
      "src": "https://www.maisonbest.com.tw/public/img/rate/MZH191022_0O7A4733.jpg"
    },
    {
      "編號": "11",
      "名稱": "中光公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、搖搖馬4組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "12",
      "名稱": "康樂公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、雙人搖搖馬1組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "13",
      "名稱": "港北崇和公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、雙人搖搖馬1組、地景雙人滑梯1組、平衡木1組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "14",
      "名稱": "中清公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、搖搖馬5組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "15",
      "名稱": "吉羊公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "16",
      "名稱": "西雅公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組1組、搖搖馬",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "17",
      "名稱": "天公壇公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具1組、搖搖馬2組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "18",
      "名稱": "台溪公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組1組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
    {
      "編號": "19",
      "名稱": "台溪親子公園",
      "地址": "北區",
      "AreaCode": "10018020",
      "備註": "組合遊具組溜滑梯1組、搖搖馬4組、盪鞦韆組1組",
      "src": "https://focus.586.com.tw/wp-content/uploads/2023/08/bf9b48299267d9c7279746fbe7b94e26-800x445.jpg"
    },
  ]
}